{"keras_version": "2.1.4-tf", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "name": "block1_conv1", "strides": [2, 2], "bias_regularizer": null, "activation": "linear", "padding": "valid", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block1_conv1_bn", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block1_conv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block1_conv1_act", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block1_conv1_act", "activation": "relu"}}, {"class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "name": "block1_conv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "padding": "valid", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block1_conv2_bn", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block1_conv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block1_conv2_act", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block1_conv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block2_sepconv1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block2_sepconv1", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 128, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block2_sepconv1_bn", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block2_sepconv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block2_sepconv2_act", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block2_sepconv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block2_sepconv2", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block2_sepconv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 128, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block2_sepconv2_bn", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block2_sepconv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "name": "conv2d_1", "strides": [2, 2], "bias_regularizer": null, "activation": "linear", "padding": "same", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "dtype": "float32", "data_format": "channels_last", "name": "block2_pool", "strides": [2, 2], "padding": "same"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "batch_normalization_1", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_1"}}, {"class_name": "Activation", "name": "block3_sepconv1_act", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block3_sepconv1_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block3_sepconv1", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block3_sepconv1", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 256, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block3_sepconv1_bn", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block3_sepconv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block3_sepconv2_act", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block3_sepconv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block3_sepconv2", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block3_sepconv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 256, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block3_sepconv2_bn", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block3_sepconv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "name": "conv2d_2", "strides": [2, 2], "bias_regularizer": null, "activation": "linear", "padding": "same", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "dtype": "float32", "data_format": "channels_last", "name": "block3_pool", "strides": [2, 2], "padding": "same"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "batch_normalization_2", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_2"}}, {"class_name": "Activation", "name": "block4_sepconv1_act", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block4_sepconv1_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block4_sepconv1", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block4_sepconv1", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block4_sepconv1_bn", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block4_sepconv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block4_sepconv2_act", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block4_sepconv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block4_sepconv2", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block4_sepconv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block4_sepconv2_bn", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block4_sepconv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": false, "name": "conv2d_3", "strides": [2, 2], "bias_regularizer": null, "activation": "linear", "padding": "same", "filters": 728, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "pool_size": [3, 3], "dtype": "float32", "data_format": "channels_last", "name": "block4_pool", "strides": [2, 2], "padding": "same"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "batch_normalization_3", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_3"}}, {"class_name": "Activation", "name": "block5_sepconv1_act", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block5_sepconv1_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block5_sepconv1", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block5_sepconv1", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block5_sepconv1_bn", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block5_sepconv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block5_sepconv2_act", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block5_sepconv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block5_sepconv2", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block5_sepconv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block5_sepconv2_bn", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block5_sepconv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block5_sepconv3_act", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block5_sepconv3_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block5_sepconv3", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block5_sepconv3", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block5_sepconv3_bn", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block5_sepconv3_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_4"}}, {"class_name": "Activation", "name": "block6_sepconv1_act", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block6_sepconv1_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block6_sepconv1", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block6_sepconv1", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block6_sepconv1_bn", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block6_sepconv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block6_sepconv2_act", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block6_sepconv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block6_sepconv2", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block6_sepconv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block6_sepconv2_bn", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block6_sepconv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block6_sepconv3_act", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block6_sepconv3_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block6_sepconv3", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block6_sepconv3", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block6_sepconv3_bn", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block6_sepconv3_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_5"}}, {"class_name": "Activation", "name": "block7_sepconv1_act", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block7_sepconv1_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block7_sepconv1", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block7_sepconv1", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block7_sepconv1_bn", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block7_sepconv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block7_sepconv2_act", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block7_sepconv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block7_sepconv2", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block7_sepconv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block7_sepconv2_bn", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block7_sepconv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block7_sepconv3_act", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block7_sepconv3_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block7_sepconv3", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block7_sepconv3", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block7_sepconv3_bn", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block7_sepconv3_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Add", "name": "add_6", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_6"}}, {"class_name": "Activation", "name": "block8_sepconv1_act", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block8_sepconv1_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block8_sepconv1", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block8_sepconv1", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block8_sepconv1_bn", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block8_sepconv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block8_sepconv2_act", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block8_sepconv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block8_sepconv2", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block8_sepconv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block8_sepconv2_bn", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block8_sepconv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block8_sepconv3_act", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block8_sepconv3_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block8_sepconv3", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block8_sepconv3", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block8_sepconv3_bn", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block8_sepconv3_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_7"}}, {"class_name": "Activation", "name": "block9_sepconv1_act", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block9_sepconv1_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block9_sepconv1", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block9_sepconv1", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block9_sepconv1_bn", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block9_sepconv1_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block9_sepconv2_act", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block9_sepconv2_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block9_sepconv2", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block9_sepconv2", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block9_sepconv2_bn", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block9_sepconv2_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Activation", "name": "block9_sepconv3_act", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "block9_sepconv3_act", "activation": "relu"}}, {"class_name": "SeparableConv2D", "name": "block9_sepconv3", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "config": {"trainable": true, "dilation_rate": [1, 1], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "pointwise_constraint": null, "use_bias": false, "depthwise_regularizer": null, "name": "block9_sepconv3", "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "pointwise_regularizer": null, "filters": 728, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "BatchNormalization", "name": "block9_sepconv3_bn", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "center": true, "name": "block9_sepconv3_bn", "gamma_regularizer": null, "gamma_constraint": null, "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Add", "name": 